avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
static void sci_transfer(sci_hdl_t const hdl);

#if SCI_CFG_FIFO_INCLUDED
static void sci_fifo_transfer(sci_hdl_t const hdl);
#endif

static sci_err_t sci_receive_async_data(sci_hdl_t const hdl,
                                        uint8_t         *p_dst,
                                        uint16_t const  length);
#endif

#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
static sci_err_t sci_init_sync(sci_hdl_t const         hdl,
                               sci_sync_sspi_t * const p_cfg,
                               uint8_t * const         p_priority);

static sci_err_t sci_send_sync_data(sci_hdl_t const hdl,
                                    uint8_t         *p_src,
                                    uint8_t         *p_dst,
                                    uint16_t const  length,
                                    bool            save_rx_data);

static sci_err_t sci_receive_sync_data(sci_hdl_t const hdl,
                                       uint8_t         *p_dst,
                                       uint16_t const  length);
#endif

static void power_on(sci_hdl_t const hdl);
static void power_off(sci_hdl_t const hdl);

#if SCI_CFG_FIFO_INCLUDED
static sci_err_t sci_init_fifo(sci_hdl_t const hdl);
#endif

static void sci_receive(sci_hdl_t const hdl);

#if SCI_CFG_FIFO_INCLUDED

#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
static void sci_fifo_receive_sync(sci_hdl_t const hdl);
#endif

static void sci_fifo_receive(sci_hdl_t const hdl);

#endif

#if SCI_CFG_DATA_MATCH_INCLUDED
static void sci_receive_data_match(sci_hdl_t const hdl);
#endif

#if ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && TX_DTC_DMACA_ENABLE)
static sci_err_t sci_send_sync_data_dma_dtc(sci_hdl_t const hdl, uint8_t *p_src, uint8_t *p_dst, uint16_t const length);
#endif

#if ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && SCI_CFG_FIFO_INCLUDED && TX_DTC_DMACA_ENABLE)
static sci_err_t sci_send_sync_data_fifo_dma_dtc(sci_hdl_t const hdl, uint8_t *p_src, uint8_t *p_dst, uint16_t const length, bool save_rx_data);
#endif

#if ((TX_DTC_DMACA_ENABLE & 0x01) && (SCI_CFG_FIFO_INCLUDED))
static void sci_fifo_transfer_dtc(sci_hdl_t const hdl);
#endif

#if ((TX_DTC_DMACA_ENABLE & 0x02) && (SCI_CFG_FIFO_INCLUDED))
static void sci_fifo_transfer_dmac(sci_hdl_t const hdl);
#endif

static void sci_error(sci_hdl_t const hdl);

#if SCI_CFG_FIFO_INCLUDED
static void sci_fifo_error(sci_hdl_t const hdl);
#endif

/* queue buffers */
#if (SCI_CFG_ASYNC_INCLUDED)

#if SCI_CFG_CH0_INCLUDED
static uint8_t  ch0_tx_buf[SCI_CFG_CH0_TX_BUFSIZ];
static uint8_t  ch0_rx_buf[SCI_CFG_CH0_RX_BUFSIZ];
#endif

#if SCI_CFG_CH1_INCLUDED
static uint8_t  ch1_tx_buf[SCI_CFG_CH1_TX_BUFSIZ];
static uint8_t  ch1_rx_buf[SCI_CFG_CH1_RX_BUFSIZ];
#endif

#if SCI_CFG_CH2_INCLUDED
static uint8_t  ch2_tx_buf[SCI_CFG_CH2_TX_BUFSIZ];
static uint8_t  ch2_rx_buf[SCI_CFG_CH2_RX_BUFSIZ];
#endif

#if SCI_CFG_CH3_INCLUDED
static uint8_t  ch3_tx_buf[SCI_CFG_CH3_TX_BUFSIZ];
static uint8_t  ch3_rx_buf[SCI_CFG_CH3_RX_BUFSIZ];
#endif

#if SCI_CFG_CH4_INCLUDED
static uint8_t  ch4_tx_buf[SCI_CFG_CH4_TX_BUFSIZ];
static uint8_t  ch4_rx_buf[SCI_CFG_CH4_RX_BUFSIZ];
#endif

#if SCI_CFG_CH5_INCLUDED
static uint8_t  ch5_tx_buf[SCI_CFG_CH5_TX_BUFSIZ];
static uint8_t  ch5_rx_buf[SCI_CFG_CH5_RX_BUFSIZ];
#endif

#if SCI_CFG_CH6_INCLUDED
static uint8_t  ch6_tx_buf[SCI_CFG_CH6_TX_BUFSIZ];
static uint8_t  ch6_rx_buf[SCI_CFG_CH6_RX_BUFSIZ];
#endif

#if SCI_CFG_CH7_INCLUDED
static uint8_t  ch7_tx_buf[SCI_CFG_CH7_TX_BUFSIZ];
static uint8_t  ch7_rx_buf[SCI_CFG_CH7_RX_BUFSIZ];
#endif

#if SCI_CFG_CH8_INCLUDED
static uint8_t  ch8_tx_buf[SCI_CFG_CH8_TX_BUFSIZ];
static uint8_t  ch8_rx_buf[SCI_CFG_CH8_RX_BUFSIZ];
#endif

#if SCI_CFG_CH9_INCLUDED
static uint8_t  ch9_tx_buf[SCI_CFG_CH9_TX_BUFSIZ];
static uint8_t  ch9_rx_buf[SCI_CFG_CH9_RX_BUFSIZ];
#endif

#if SCI_CFG_CH10_INCLUDED
static uint8_t  ch10_tx_buf[SCI_CFG_CH10_TX_BUFSIZ];
static uint8_t  ch10_rx_buf[SCI_CFG_CH10_RX_BUFSIZ];
#endif

#if SCI_CFG_CH11_INCLUDED
static uint8_t  ch11_tx_buf[SCI_CFG_CH11_TX_BUFSIZ];
static uint8_t  ch11_rx_buf[SCI_CFG_CH11_RX_BUFSIZ];
#endif

#if SCI_CFG_CH12_INCLUDED
static uint8_t  ch12_tx_buf[SCI_CFG_CH12_TX_BUFSIZ];
static uint8_t  ch12_rx_buf[SCI_CFG_CH12_RX_BUFSIZ];
#endif

#endif /* #if (SCI_CFG_ASYNC_INCLUDED) */

extern const sci_hdl_t g_handles[SCI_NUM_CH];


/***********************************************************************************************************************
* Function Name: R_SCI_Open
********************************************************************************************************************//**
* @brief This function applies power to the SCI channel, initializes the associated registers, enables interrupts, and
* provides the channel handle for use with other API functions. This function must be called before calling any
* other API functions
* @param[in]    chan  Channel to initialize.
*
* @param[in]    mode  Operational mode (see enumeration below)
* @code
typedef enum e_sci_mode     // SCI operational modes
{
    SCI_MODE_OFF=0,         // channel not in use
    SCI_MODE_ASYNC,         // Asynchronous
    SCI_MODE_SSPI,          // Simple SPI
    SCI_MODE_SYNC,          // Synchronous
    SCI_MODE_IRDA,          // Infrared Data Association
    SCI_MODE_MAX            // End of modes currently supported
} sci_mode_t;
* @endcode
* @param[in]    p_cfg  Pointer to configuration union, structure elements (see below) are specific to mode
* @code
typedef union
{
    sci_uart_t      async;
    sci_sync_sspi_t sync;
    sci_sync_sspi_t sspi;
    sci_irda_t      irda;
} sci_cfg_t;
* @endcode
*
* @param[in]    p_callback Pointer to function called from interrupt when an RXI or receiver error is detected or
* for transmit end (TEI) condition. See Section 2.11 Callback Function in application note for details.
*
* @param[in]    p_hdl  Pointer to a handle for channel (value set here)
* Confirm the return value from R_SCI_Open is “SCI_SUCCESS” and then set the first parameter for the
* other APIs except R_SCI_GetVersion(). See Section 2.9 Parameters in the application note for details.
*
*
* @retval   SCI_SUCCESS  Successful; channel initialized 
*
* @retval   SCI_ERR_BAD_CHAN  Channel number is invalid for part
*
* @retval   SCI_ERR_OMITTED_CHAN  Corresponding SCI_CHx_INCLUDED is invalid (0) 
*
* @retval   SCI_ERR_CH_NOT_CLOSED  Channel currently in operation; Perform R_SCI_Close() first
*
* @retval   SCI_ERR_BAD_MODE  Mode specified not currently supported
*
* @retval   SCI_ERR_NULL_PTR  p_cfg pointer is NULL
*
* @retval   SCI_ERR_INVALID_ARG  An element of the p_cfg structure contains an invalid value.
*
* @retval   SCI_ERR_QUEUE_UNAVAILABLE  Cannot open transmit or receive queue or both (Asynchronous mode).
* @details  Initializes an SCI channel for a particular mode and provides a Handle in *p_hdl for use with other API
* functions. RXI and ERI interrupts are enabled in all modes. TXI is enabled in Asynchronous mode
* @note  The driver calculates the optimum values for BRR, SEMR.ABCS, and SMR.CKS using BSP_PCLKA_HZ and
* BSP_PCLKB_HZ as defined in mcu_info.h of the board support package. This however does not guarantee
* a low bit error rate for all peripheral clock/baud rate combinations.
* If an external clock is used in Asynchronous mode, the pin direction must be selected before calling the
* R_SCI_Open() function, and the pin function and mode must be selected after calling the R_SCI_Open()
* function. See Section 3. R_SCI_Open() in the application note for details.
*/
sci_err_t R_SCI_Open(uint8_t const      chan,
                     sci_mode_t const   mode,
                     sci_cfg_t * const  p_cfg,
                     void               (* const p_callback)(void *p_args),
                     sci_hdl_t * const  p_hdl)
{
    sci_err_t   err = SCI_SUCCESS;
    uint8_t     priority = 1;

    /* CHECK ARGUMENTS */
#if SCI_CFG_PARAM_CHECKING_ENABLE
    err = sci_mcu_param_check(chan);
    if (SCI_SUCCESS != err)
    {
        return err;
    }

    /* Check argument g_handles */
    if ((NULL == g_handles[chan]) || (FIT_NO_PTR == g_handles[chan]))
    {
        return SCI_ERR_OMITTED_CHAN;
    }
    if (SCI_MODE_OFF != g_handles[chan]->mode)
    {
        return SCI_ERR_CH_NOT_CLOSED;
    }
    if ((SCI_MODE_OFF == mode) || (SCI_MODE_MAX <= mode))
    {
        return SCI_ERR_BAD_MODE;
    }

    /* Check argument p_cfg, p_hdl */
    if (((NULL == p_cfg) || (NULL == p_hdl)) || ((FIT_NO_PTR == p_cfg) || (FIT_NO_PTR == p_hdl)))
    {
        return SCI_ERR_NULL_PTR;
    }
#endif

