avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
    /* Check arguments */

#if SCI_CFG_PARAM_CHECKING_ENABLE
    /* Check argument hdl, p_src */
    if (((NULL == hdl)   || (FIT_NO_PTR == hdl)) || ((NULL == p_src) || (FIT_NO_PTR == p_src)))
    {
        return SCI_ERR_NULL_PTR;
    }
    if ((SCI_MODE_OFF == hdl->mode) || (SCI_MODE_MAX <= hdl->mode))
    {
        return SCI_ERR_BAD_MODE;
    }
    if (0 == length)
    {
        return SCI_ERR_INVALID_ARG;
    }
#endif

    if ((SCI_MODE_ASYNC == hdl->mode) || (SCI_MODE_IRDA == hdl->mode))
    {
        /* ASYNC or IRDA */
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
        err = sci_send_async_data(hdl, p_src, length);
#endif
    }
    else
    {
        /* SSPI or SYNC */
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
        err = sci_send_sync_data(hdl, p_src, NULL, length, false);
#endif
    }

    return err;
} /* End of function R_SCI_Send() */


#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
/*****************************************************************************
* Function Name: sci_send_async_data
* Description  : This function determines if the tx byte queue of the channel
*                referenced by the handle is not full, and call the byte
*                transmission function.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    ptr to data to transmit
*                length -
*                    number of bytes to send and possibly receive
* Return Value : SCI_SUCCESS -
*                    data transfer started
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy
*                SCI_ERR_INSUFFICIENT_SPACE - 
*                    not enough space in tx queue to store data (Async)
******************************************************************************/
static sci_err_t sci_send_async_data(sci_hdl_t const hdl,
                                     uint8_t         *p_src,
                                     uint16_t const  length)
{
    sci_err_t   err = SCI_SUCCESS;
    uint16_t    cnt;
    byteq_err_t byteq_err = BYTEQ_ERR_QUEUE_FULL;
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
#if (TX_DTC_DMACA_ENABLE & 0x01 || TX_DTC_DMACA_ENABLE & 0x02)
    /* Keep checking tx_idle when using DTC/DMAC */
    if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable || SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
    {
        if (true != hdl->tx_idle  )
        {
            return SCI_ERR_XCVR_BUSY;
        }
    }
#endif
#else
    if (true != hdl->tx_idle  )
    {
        return SCI_ERR_XCVR_BUSY;
    }
#endif
#if SCI_CFG_FIFO_INCLUDED
    if (true == hdl->fifo_ctrl)
    {
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
#if (TX_DTC_DMACA_ENABLE & 0x01 || TX_DTC_DMACA_ENABLE & 0x02)
        /* Keep checking tx_idle when using DTC/DMAC */
        if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable || SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
        {
            /* TX FIFO use check */
            if (0x00 < hdl->rom->regs->FDR.BIT.T)
            {
                return SCI_ERR_XCVR_BUSY;
            }
            /* reset TX FIFO */
            hdl->rom->regs->FCR.BIT.TFRST = 0x01;
        }
#endif
#else
        /* TX FIFO use check */
        if (0x00 < hdl->rom->regs->FDR.BIT.T)
        {
            return SCI_ERR_XCVR_BUSY;
        }

        /* reset TX FIFO */
        hdl->rom->regs->FCR.BIT.TFRST = 0x01;
#endif

#if (TX_DTC_DMACA_ENABLE != 0)
        sci_fifo_ctrl_t *p_tctrl;
        p_tctrl = &hdl->queue[hdl->qindex_app_tx];
        p_tctrl->p_tx_buf = p_src;              /* dummy byte sent when NULL (Sync) */
        p_tctrl->tx_cnt = length;             /* length must be set after buf ptr */
        p_tctrl->total_length = length;       /* used for dtc in txi_handler */

#if (TX_DTC_DMACA_ENABLE)
       p_tctrl->p_tx_fraction_buf = p_src;
       p_tctrl->tx_fraction = length;
#endif
#endif

#if (TX_DTC_DMACA_ENABLE & 0x01)

        if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
        {
            err = sci_txfifo_dtc_create(hdl, p_src, length);
        }
        else
#endif
        {
#if (TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_txfifo_dmaca_create(hdl, p_src, length);
            }
            else
#endif
            {
            /* Determine amount of space left in tx queue */
                R_BYTEQ_Unused(hdl->u_tx_data.que, &cnt);
                if (cnt < length)
                {
                    /* If can't fit, return */
                    return SCI_ERR_INSUFFICIENT_SPACE;
                }

                /* Else load bytes into tx queue for transmission */
                /* WAIT_LOOP */
                for (cnt = 0; cnt < length; cnt++)
                {
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
                    byteq_err = sci_put_byte(hdl, *p_src++);
                    
                    /* Allow TX interrupt occur */
                    ENABLE_TXI_INT;
#else
                    byteq_err = sci_put_byte(hdl, *p_src++);
#endif
                    if (BYTEQ_SUCCESS != byteq_err)
                    {
                        /* If the return value is not BYTEQ_SUCCESS. */
                        err = SCI_ERR_INSUFFICIENT_SPACE;
                        break;
                    }
                }
            }
        }
    }
    else /*that channel do not use FIFO but SCI_CFG_FIFO_INCLUDED == true*/
#endif /* SCI_CFG_FIFO_INCLUDED */
    {
#if (TX_DTC_DMACA_ENABLE & 0x01)
        if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
        {
            err = sci_tx_dtc_create(hdl, p_src, length);
        }
        else

#endif
        {
#if (TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_tx_dmaca_create(hdl, p_src, length);
            }
            else
#endif
            {
            /* Determine amount of space left in tx queue */
                R_BYTEQ_Unused(hdl->u_tx_data.que, &cnt);

                if (cnt < length)
                {
                    /* If can't fit, return */
                    return SCI_ERR_INSUFFICIENT_SPACE;
                }

                /* Else load bytes into tx queue for transmission */
                /* WAIT_LOOP */
                for (cnt = 0; cnt < length; cnt++)
                {
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
                    byteq_err = sci_put_byte(hdl, *p_src++);
                    ENABLE_TXI_INT;
#else
                    byteq_err = sci_put_byte(hdl, *p_src++);
#endif
                    if (BYTEQ_SUCCESS != byteq_err)
                    {
                        /* If the return value is not BYTEQ_SUCCESS. */
                        err = SCI_ERR_INSUFFICIENT_SPACE;
                        break;
                    }
                }
            }
        }
    }
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
#if (TX_DTC_DMACA_ENABLE & 0x01 || TX_DTC_DMACA_ENABLE & 0x02)
        /* Keep checking tx_idle when using DTC/DMAC */
        if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable || SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
        {
            if (SCI_SUCCESS == err)
            {
                hdl->tx_idle = false;
                ENABLE_TXI_INT;
            }
        }
#endif
#else
    if (SCI_SUCCESS == err)
    {
        hdl->tx_idle = false;
        ENABLE_TXI_INT;
    }
#endif


