avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
    return err;
} /* End of function sci_send_async_data() */

/*****************************************************************************
* Function Name: sci_put_byte
* Description  : Transmits byte if channel is not busy. Otherwise, byte is
*                stored in tx queue until can transmit. If buffer is full
*                and cannot store it, an error code is returned.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                byte -
*                    byte to transmit
* Return Value : SCI_SUCCESS -
*                    data transfer started
*                SCI_ERR_INSUFFICIENT_SPACE - 
*                    not enough space in tx queue to store data (Async)
******************************************************************************/
static byteq_err_t sci_put_byte(sci_hdl_t const   hdl,
                                uint8_t const     byte)
{
    byteq_err_t err = BYTEQ_ERR_QUEUE_FULL;

    /* else load next byte into tx queue (space checked in calling func) */
    err = R_BYTEQ_Put(hdl->u_tx_data.que, byte);

    return err;
} /* End of function sci_put_byte() */
#endif /* SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED */


#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
/*****************************************************************************
* Function Name: sci_send_sync_data
* Description  : This function determines if the channel referenced by the
*                handle is not busy, and begins the data transfer process
*                (both sending and receiving data).
*
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    ptr to data to transmit
*                p_dst -
*                    ptr to buffer to store receive data (optional)
*                length -
*                    number of bytes to send and possibly receive
*                save_rx_data -
*                    true if data clocked in should be saved to p_dst.
* Return Value : SCI_SUCCESS -
*                    data transfer started
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy
******************************************************************************/
static sci_err_t sci_send_sync_data(sci_hdl_t const hdl,
                                    uint8_t         *p_src,
                                    uint8_t         *p_dst,
                                    uint16_t const  length,
                                    bool            save_rx_data)
{
#if SCI_CFG_FIFO_INCLUDED
    uint8_t cnt;
    volatile uint8_t thresh_cnt;
#endif
    sci_err_t   err = SCI_SUCCESS;

    if (true == hdl->tx_idle)
    {

        if (true == save_rx_data)
        {
            hdl->u_rx_data.buf = p_dst;
        }
        hdl->save_rx_data  = save_rx_data;

        hdl->u_tx_data.buf = p_src;
        hdl->tx_cnt        = length;
        hdl->rx_cnt        = length;
        hdl->tx_idle       = false;
        hdl->tx_dummy      = false;

#if SCI_CFG_FIFO_INCLUDED
        if (true == hdl->fifo_ctrl)
        {
            /* reset TX FIFO */
            hdl->rom->regs->FCR.BIT.TFRST = 0x01;

            /* reset RX FIFO */
            hdl->rom->regs->FCR.BIT.RFRST = 0x01;

#if (TX_DTC_DMACA_ENABLE && RX_DTC_DMACA_ENABLE)
            if ((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
            {
                err = sci_send_sync_data_fifo_dma_dtc(hdl, p_src, p_dst, length, false);
            }
            else
#endif 
            {
                /* If length is lower than SCI_CFG_CHXX_RX_FIFO_THRESH, FCR.BIT.RTRG register is set to length */
                if (length < hdl->rx_curr_thresh)
                {
                    hdl->rom->regs->FCR.BIT.RTRG = length;
                }

                thresh_cnt = hdl->rom->regs->FCR.BIT.RTRG;
                
                hdl->tx_cnt -= thresh_cnt;

                /* Repeated FIFO RX threshold count */
                /* WAIT_LOOP */
                for (cnt = 0; cnt < thresh_cnt; cnt++)
                {
                    if(0 != cnt)
                    {
                        hdl->u_tx_data.buf++;
                    }
                    SCI_TDR(*hdl->u_tx_data.buf);    /* start transmit */
                }
            }
        }
        else
#endif /* SCI_CFG_FIFO_INCLUDED */
        {
#if (TX_DTC_DMACA_ENABLE & 0x01)
            if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                if(true == hdl->save_rx_data)
                {
                    err = sci_send_sync_data_dma_dtc(hdl, p_src, p_dst, length);
                }
                else
                {
                    err = sci_send_sync_data_dma_dtc(hdl, p_src, NULL, length);
                }
                hdl->tx_idle = false;
                return err;
            }
            else
#endif
            {
#if (TX_DTC_DMACA_ENABLE & 0x02)
                if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
                {
                    hdl->tx_idle = false;
                    if(true == hdl->save_rx_data)
                    {
                        err = sci_send_sync_data_dma_dtc(hdl, p_src, p_dst, length);
                    }
                    else
                    {
                        err = sci_send_sync_data_dma_dtc(hdl, p_src, NULL, length);
                    }

                    return err;
                }
                else
#endif
                {
                    hdl->tx_cnt--;
                    SCI_TDR(*hdl->u_tx_data.buf);    /* start transmit */
                }
            }
        }
        return err;
    }
    return SCI_ERR_XCVR_BUSY;
} /* End of function sci_send_sync_data() */
#endif /* SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
/***********************************************************************************************************************
* Function Name: R_SCI_SendReceive
********************************************************************************************************************//**
* @brief  For Synchronous and SSPI modes only. Transmits and receives data simultaneously if the transceiver is not
* in use.
*
* @param[in]    hdl  Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
* @param[in]    p_src  Pointer to data to transmit
*
* @param[in]    p_dst  Pointer to buffer to load data into
*
* @param[in]    length  Number of bytes to send
*
* @retval   SCI_SUCCESS  Data transfer initiated
*
* @retval   SCI_ERR_NULL_PTR  hdl value is NULL
*
* @retval   SCI_ERR_BAD_MODE  Channel mode not SSPI or Synchronous
*
* @retval   SCI_ERR_XCVR_BUSY  Channel currently busy
* @details   If the transceiver is not in use, this function clocks out data from the p_src buffer while simultaneously
* clocking in data and placing it in the p_dst buffer.
* Note that the toggling of Slave Select lines for SSPI is not handled by this driver. The Slave Select line for
* the target device must be enabled prior to calling this function.
* Also, toggling of the CTS/RTS pin in Synchronous/Asynchronous mode is not handled by this driver.
*
* @note See section 2.11 Callback Function in application note for values passed to arguments of the callback function.
*/
sci_err_t R_SCI_SendReceive(sci_hdl_t const hdl,
                            uint8_t         *p_src,
                            uint8_t         *p_dst,
                            uint16_t const  length)
{
    sci_err_t   err;

