avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
#if SCI_CFG_PARAM_CHECKING_ENABLE
    /* Check arguments */
    if ((((NULL == hdl)   || (FIT_NO_PTR == hdl))    /* Check if hdl is available or not   */
     ||  ((NULL == p_src) || (FIT_NO_PTR == p_src))) /* Check if p_src is available or not */
     ||  ((NULL == p_dst) || (FIT_NO_PTR == p_dst))) /* Check if p_dst is available or not */
    {
        return SCI_ERR_NULL_PTR;
    }

    if ((SCI_MODE_SSPI != hdl->mode) && (SCI_MODE_SYNC != hdl->mode))
    {
        return SCI_ERR_BAD_MODE;
    }

    if (0 == length)
    {
        return SCI_ERR_INVALID_ARG;
    }
#endif

    err = sci_send_sync_data(hdl, p_src, p_dst, length, true);

    return err;
} /* End of function R_SCI_SendReceive() */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */


#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
/*****************************************************************************
* Function Name: sci_transfer
* Description  : Transfer for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_transfer(sci_hdl_t const hdl)
{
    uint16_t    num;
    uint8_t     byte;
    byteq_err_t err;
    
    /* Get bytes from tx queue */
    err = R_BYTEQ_Get(hdl->u_tx_data.que, (uint8_t *)&byte);
    if(BYTEQ_SUCCESS == err)
    {
        /* TDR/FTDR register write access */
        SCI_TDR(byte);
    }

    /* Get data byte number from que and if the number of data bytes is 0, to disable the transfer */
    R_BYTEQ_Used(hdl->u_tx_data.que, &num);
    if (0 >= num)
    {
        /* Disable transmit interrupt */
        DISABLE_TXI_INT;
#if SCI_CFG_TEI_INCLUDED
        /* Enable transmit end interrupt */
        hdl->rom->regs->SCR.BIT.TEIE = 1;
        ENABLE_TEI_INT;
#endif
        hdl->tx_idle = true;    // set flag if queue empty
    }
} /* End of function sci_transfer() */
#endif /* SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED */

#if (SCI_CFG_ASYNC_INCLUDED)
#if SCI_CFG_FIFO_INCLUDED
/*****************************************************************************
* Function Name: sci_fifo_transfer
* Description  : FIFO Transfer for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_transfer(sci_hdl_t const hdl)
{
    uint8_t cnt;
    uint8_t fifo_num;

    /* Repeated empty FIFO buffer count */
    fifo_num = SCI_FIFO_FRAME_SIZE - hdl->rom->regs->FDR.BIT.T;

    /* WAIT_LOOP */
    for (cnt = 0; cnt < fifo_num; cnt++)
    {
        /* SCI Transfer */
        sci_transfer(hdl);

        /* If the queue is empty(true == hdl->tx_idle), exit from FIFO transfer loop */
        if (true == hdl->tx_idle)
        {
            break;
        }
    }

    /* When the settings of transmit data are completed, set the SSRFIFO.TDFE flag to 0. */
    if (1 == hdl->rom->regs->SSRFIFO.BIT.TDFE)
    {
        /* Casting register 8 bits to unsigned char type is valid */
        hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_TDFE_MASK;
    }
} /* End of function sci_fifo_transfer() */
#endif /*End of SCI_CFG_FIFO_INCLUDED */
#endif /* SCI_CFG_ASYNC_INCLUDED */

#if ((SCI_CFG_ASYNC_INCLUDED) || (TX_DTC_DMACA_ENABLE | RX_DTC_DMACA_ENABLE) || (SCI_CFG_IRDA_INCLUDED))
/*****************************************************************************
* Function Name: txi_handler
* Description  : TXI interrupt handler for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void txi_handler(sci_hdl_t const hdl)
{
#if SCI_CFG_FIFO_INCLUDED
    if (true == hdl->fifo_ctrl)
    {
#if (TX_DTC_DMACA_ENABLE)
        if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable))
        {
#if(TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                if((4 == hdl->rom->dmaca_tx_channel) || (5 == hdl->rom->dmaca_tx_channel) || (6 == hdl->rom->dmaca_tx_channel) || (7 == hdl->rom->dmaca_tx_channel))
                {
                    dmaca_stat_t   stat_dmaca;
                    R_DMACA_Control(hdl->rom->dmaca_tx_channel, DMACA_CMD_DTIF_STATUS_CLR, &stat_dmaca);
                }
                
                R_DMACA_Close(hdl->rom->dmaca_tx_channel);
            }
#endif
#if (TX_DTC_DMACA_ENABLE & 0x01)
            if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                sci_fifo_transfer_dtc(hdl);
                return;
            }
#endif
#if(TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                sci_fifo_transfer_dmac(hdl);
            }
#endif
        }
        else
#endif
        {
#if (SCI_CFG_ASYNC_INCLUDED)
            /* SCI FIFO Transfer */
            sci_fifo_transfer(hdl);
#endif
        }
    }
    else
#endif /* SCI_CFG_FIFO_INCLUDED */
    {
#if (TX_DTC_DMACA_ENABLE)
        if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable))
        {
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
            if ((SCI_MODE_ASYNC == hdl->mode) || (SCI_MODE_IRDA == hdl->mode))
            {
                hdl->tx_idle = true;
            }
#endif
#if SCI_CFG_TEI_INCLUDED
            /* Enable transmit end interrupt */
            hdl->rom->regs->SCR.BIT.TEIE = 1;
            ENABLE_TEI_INT;
#endif
            DISABLE_TXI_INT;

#if(TX_DTC_DMACA_ENABLE & 0x02)
            if(SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                if((4 == hdl->rom->dmaca_tx_channel) || (5 == hdl->rom->dmaca_tx_channel) || (6 == hdl->rom->dmaca_tx_channel) || (7 == hdl->rom->dmaca_tx_channel))
                {
                    dmaca_stat_t   stat_dmaca;
                    R_DMACA_Control(hdl->rom->dmaca_tx_channel, DMACA_CMD_DTIF_STATUS_CLR, &stat_dmaca);
                }
                
                R_DMACA_Int_Disable(hdl->rom->dmaca_tx_channel);
                R_DMACA_Close(hdl->rom->dmaca_tx_channel);
                *hdl->rom->ir_txi = 1;
            }
#endif
            return;
        }
        else
#endif /* (TX_DTC_DMACA_ENABLE) */
        {
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
            /* SCI Transfer */
            sci_transfer(hdl);
#endif
        }
    }
} /* End of function txi_handler() */
#endif /* ((SCI_CFG_ASYNC_INCLUDED) || (TX_DTC_DMACA_ENABLE | RX_DTC_DMACA_ENABLE) || (SCI_CFG_IRDA_INCLUDED) */


#if SCI_CFG_TEI_INCLUDED
/*****************************************************************************
* Function Name: tei_handler
* Description  : TEI interrupt handler for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void tei_handler(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;

    /* Disable transmit end interrupt */
    DISABLE_TEI_INT;
    hdl->rom->regs->SCR.BIT.TEIE = 0;

    /* Activate callback function if available */
    if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
    {
        args.hdl = hdl;
        args.event = SCI_EVT_TEI;

        /* Activate callback function */
        hdl->callback((void *)&args);
    }
} /* End of function tei_handler() */
#endif


