avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
            /* Get bytes from rx queue */
            /* WAIT_LOOP */
            for (cnt = 0; cnt < length; cnt++)
            {
#if (SCI_CFG_USE_CIRCULAR_BUFFER == 1)
                byteq_err = R_BYTEQ_Get(hdl->u_rx_data.que, p_dst++);
#else
                /* Disable RXI Interrupt */
                DISABLE_RXI_INT;
                byteq_err = R_BYTEQ_Get(hdl->u_rx_data.que, p_dst++);
                ENABLE_RXI_INT;
#endif
                if (BYTEQ_SUCCESS != byteq_err)
                {
                    err = SCI_ERR_INSUFFICIENT_DATA;
                    break;
                }
            }
        }
    }
    return err;
} /* End of function sci_receive_async_data() */
#endif /* SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED */

#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
/*****************************************************************************
* Function Name: sci_receive_sync_data
* Description  : This function determines if the channel referenced by the
*                handle is not busy, and dummy data send.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_dst -
*                    ptr to buffer to load data into
*                length - 
*                    number of bytes to read
* Return Value : SCI_SUCCESS -
*                    requested number of byte loaded into p_dst
*                SCI_ERR_XCVR_BUSY -
*                    channel currently busy
******************************************************************************/
static sci_err_t sci_receive_sync_data(sci_hdl_t const hdl,
                                       uint8_t         *p_dst,
                                       uint16_t const  length)
{
#if SCI_CFG_FIFO_INCLUDED
    uint8_t cnt;
    uint8_t thresh_cnt;
#endif

    /* IF TRANCEIVER NOT IN USE, START DUMMY TRANSMIT TO CLOCK IN DATA */
    if (true == hdl->tx_idle)
    {
        hdl->u_rx_data.buf = p_dst;
        hdl->save_rx_data  = true;               /* save the data clocked in */
        hdl->tx_idle       = false;
        hdl->tx_cnt        = length;
        hdl->rx_cnt        = length;
        hdl->tx_dummy      = true;

#if SCI_CFG_FIFO_INCLUDED
        if (true == hdl->fifo_ctrl)
        {
            /* reset TX FIFO */
            hdl->rom->regs->FCR.BIT.TFRST = 0x01;

            /* reset RX FIFO */
            hdl->rom->regs->FCR.BIT.RFRST = 0x01;
#if (SCI_DTC_DMACA_DISABLE != RX_DTC_DMACA_ENABLE)
            if((SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
            {
                sci_fifo_ctrl_t *p_ctrl;
                p_ctrl = &hdl->queue[hdl->qindex_app_rx];
                p_ctrl->p_rx_buf = p_dst;
                p_ctrl->rx_cnt = length;              /* length must be set after buf ptr */
                p_ctrl->p_rx_fraction_buf = p_dst;
                p_ctrl->rx_fraction = length;
                return sci_send_sync_data_fifo_dma_dtc(hdl, NULL, p_dst, length, false);
            }
            else
#endif
            {
                if (length > SCI_FIFO_FRAME_SIZE)
                {
                    thresh_cnt = SCI_FIFO_FRAME_SIZE;
                }
                else
                {
                    /* If length is lower than SCI_CFG_CHXX_RX_FIFO_THRESH, FCR.BIT.RTRG register is set to length */
                    if (length < hdl->rx_curr_thresh)
                    {
                        hdl->rom->regs->FCR.BIT.RTRG = length;
                    }
                    thresh_cnt = length;
                }

                hdl->tx_cnt -= thresh_cnt;

                /* WAIT_LOOP */
                for (cnt = 0; cnt < thresh_cnt; cnt++)
                {
                    SCI_TDR(SCI_CFG_DUMMY_TX_BYTE);    /* start transmit */
                }
            }
        }
        else
#endif /* End of SCI_CFG_FIFO_INCLUDED */
        {
#if (SCI_DTC_DMACA_DISABLE != RX_DTC_DMACA_ENABLE)
            if((SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
            {
                sci_send_sync_data_dma_dtc(hdl, NULL, p_dst, length);
            }
            else
#endif
            {
                hdl->tx_cnt--;
                SCI_TDR(SCI_CFG_DUMMY_TX_BYTE);    /* start transfer */
            }
        }
        return SCI_SUCCESS;
    }

    return SCI_ERR_XCVR_BUSY;
} /* End of function sci_receive_sync_data() */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

/*****************************************************************************
* Function Name: sci_receive
* Description  : Receive for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_receive(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;
    uint8_t         byte;

    /* Read byte */
    SCI_RDR(byte);
    if ((SCI_MODE_ASYNC == hdl->mode) || (SCI_MODE_IRDA == hdl->mode))
    {
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)

        /* Place byte in queue */
        if (R_BYTEQ_Put(hdl->u_rx_data.que, byte) == BYTEQ_SUCCESS)
        {
            args.event = SCI_EVT_RX_CHAR;
        }
        else
        {
            args.event = SCI_EVT_RXBUF_OVFL;
        }

        /* Do callback if available */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

           /* Casting to void type is valid */
            hdl->callback((void *)&args);
        }
#endif
    }
    else
    {
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
        hdl->rx_cnt--;

        /* Place byte in buffer if Receive() or SendReceive() */
        if (true == hdl->save_rx_data)
        {
            *hdl->u_rx_data.buf++ = byte;
        }

        /* See if more bytes to transfer */
        if (0 < hdl->rx_cnt)
        {
            if (0 < hdl->tx_cnt)
            {
                /* send another byte */
                if (true == hdl->tx_dummy)
                {
                    hdl->tx_cnt--;
                    SCI_TDR(SCI_CFG_DUMMY_TX_BYTE);
                }
                else
                {
                    hdl->tx_cnt--;
                    hdl->u_tx_data.buf++;
                    SCI_TDR(*hdl->u_tx_data.buf);
                }
            }
        }
        else
        {
            hdl->tx_idle = true;

