avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
            /* Do callback if available */
            if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
            {
                args.hdl = hdl;
                args.event = SCI_EVT_XFER_DONE;

                /* Casting to void type is valid */
                hdl->callback((void *)&args);
            }
        }
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */
    }
} /* End of function sci_receive() */

#if ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && TX_DTC_DMACA_ENABLE)
/*****************************************************************************
* Function Name: sci_send_sync_data_dma_dtc
* Description  : Send and receive data when using DTC/DMAC with non FIFO
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    Pointer to source address
*                p_dst -
*                    Pointer to dst address
*                length -
*                    Data length
* Return Value : SCI_SUCCESS if process is successful, else process is failed.
******************************************************************************/
static sci_err_t sci_send_sync_data_dma_dtc(sci_hdl_t const hdl, uint8_t *p_src, uint8_t *p_dst, uint16_t const length)
{
        sci_err_t        err;

        err = SCI_SUCCESS;

        if (SCI_SUCCESS == err)
        {
            /* Do NOT attempt to load fifo at application level.
             * Set up arguments and enable transmitter to kick off transmit. */
    #if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
            /* Set up rx control. Data ignored when p_dst is NULL. */
            if ((SCI_MODE_SYNC == hdl->mode) || (SCI_MODE_SSPI == hdl->mode))
            {

    #if (RX_DTC_DMACA_ENABLE & 0x01)
                if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
                {
                    sci_fifo_ctrl_t *p_rctrl;
                    p_rctrl = &hdl->queue[hdl->qindex_app_rx];
                    p_rctrl->p_rx_buf = p_dst;
                    p_rctrl->rx_cnt = length;
                    err = sci_rx_dtc_create(hdl, p_dst, length);
                }
    #endif
    #if (RX_DTC_DMACA_ENABLE & 0x02)
                if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
                {
                    sci_fifo_ctrl_t *p_rctrl;
                    p_rctrl = &hdl->queue[hdl->qindex_app_rx];
                    p_rctrl->p_rx_buf = p_dst;
                    p_rctrl->rx_cnt = length;
                    err = sci_rx_dmaca_create(hdl, p_dst, length);
                }
    #endif
            }
    #endif /* (SCI_CFG_SYNC_INCLUDED) */
        }

        if (SCI_SUCCESS == err)
        {
    #if (TX_DTC_DMACA_ENABLE & 0x01)
            if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_tx_dtc_create(hdl, p_src, length);
            }
    #endif
    #if (TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_tx_dmaca_create(hdl, p_src, length);
            }
    #endif
        }

        if (SCI_SUCCESS == err)
        {
            DISABLE_TXI_INT;               /* disable interrupt in icu */
            hdl->tx_idle = false;
            ENABLE_TXI_INT;
        }

        return err;
} /* End of function sci_send_sync_data_dma_dtc() */
#endif /* ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && TX_DTC_DMACA_ENABLE) */

#if SCI_CFG_FIFO_INCLUDED
#if ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && TX_DTC_DMACA_ENABLE)
/*****************************************************************************
* Function Name: sci_send_sync_data_fifo_dma_dtc
* Description  : Send and receive data when using DTC/DMAC with FIFO
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    Pointer to source address
*                p_dst -
*                    Pointer to dst address
*                length -
*                    Data length
*                save_rx_data -
*                    Save Rx data in Sync mode ir not.
* Return Value : SCI_SUCCESS if process is successful, else process is failed.
******************************************************************************/
static sci_err_t sci_send_sync_data_fifo_dma_dtc(sci_hdl_t const hdl, uint8_t *p_src, uint8_t *p_dst, uint16_t const length, bool save_rx_data)
{
    #if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
        sci_fifo_ctrl_t *p_rctrl;
    #endif
        sci_fifo_ctrl_t *p_tctrl;
        sci_err_t        err;

        err = SCI_SUCCESS;

        /* If two requests outstanding or Async break in progress, return busy */
        p_tctrl = &hdl->queue[hdl->qindex_app_tx];

        p_tctrl->total_length = length; /* Used for DTC in txi_handler() */

        if (SCI_SUCCESS == err)
        {
            /* Do NOT attempt to load fifo at application level.
             * Set up arguments and enable transmitter to kick off transmit. */
    #if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
            /* Set up rx control. Data ignored when p_dst is NULL. */
            if ((SCI_MODE_SYNC == hdl->mode) || (SCI_MODE_SSPI == hdl->mode))
            {
                p_rctrl = &hdl->queue[hdl->qindex_app_rx];
                p_rctrl->p_rx_buf = p_dst;
                p_rctrl->rx_cnt = length;

    #if (RX_DTC_DMACA_ENABLE & 0x01)
                if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
                {
                    err = sci_rxfifo_dtc_create(hdl, p_dst, length);
                }
    #endif
    #if (RX_DTC_DMACA_ENABLE & 0x02)
                if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
                {
                    err = sci_rxfifo_dmaca_create(hdl, p_dst, length);
                }
    #endif
            }
    #endif /* (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) */
        }

        if (SCI_SUCCESS == err)
        {
            p_tctrl->p_tx_buf = p_src;              /* dummy byte sent when NULL (Sync) */
            p_tctrl->tx_cnt = length;             /* length must be set after buf ptr */

#if (TX_DTC_DMACA_ENABLE & 0x01)
            if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_txfifo_dtc_create(hdl, p_src, length);
            }
#endif
#if (TX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
            {
                err = sci_txfifo_dmaca_create(hdl, p_src, length);
            }
#endif
        }

        if (SCI_SUCCESS == err)
        {
    #if ((RX_DTC_DMACA_ENABLE) && (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED))
            hdl->rom->regs->SSRFIFO.BIT.RDF = 0;
    #endif
            DISABLE_TXI_INT;               /* disable interrupt in icu */

