avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
            hdl->tx_idle = false;

            ENABLE_TXI_INT;
        }

        return err;
} /* End of function sci_send_sync_data_fifo_dma_dtc() */
#endif /* ((SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED) && TX_DTC_DMACA_ENABLE) */
#endif /* SCI_CFG_FIFO_INCLUDED */


#if SCI_CFG_FIFO_INCLUDED
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
/*****************************************************************************
* Function Name: sci_fifo_receive_sync
* Description  : FIFO Receive for SCI mode is SYNC and SSPI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_receive_sync(sci_hdl_t const hdl)
{
    uint8_t       cnt;
    uint8_t       fifo_num_rx;
    uint8_t       fifo_num_tx;
    sci_cb_args_t args;
    uint8_t       byte_rx[SCI_FIFO_FRAME_SIZE];
#if(RX_DTC_DMACA_ENABLE)
    if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
    {
        if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
        {
            sci_fifo_ctrl_t  *p_rctrl;
            volatile uint8_t            byte;   /* volatile to remove "not used" warning */
            volatile uint8_t                     tmp_reg_frdr;

#if (RX_DTC_DMACA_ENABLE & 0x02)
if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
{
            R_DMACA_Int_Disable(hdl->rom->dmaca_rx_channel);
            R_DMACA_Close(hdl->rom->dmaca_rx_channel);
}
#endif

        p_rctrl = &hdl->queue[hdl->qindex_int_rx];

#if (RX_DTC_DMACA_ENABLE)
            if (SCI_DTC_DMACA_DISABLE != hdl->rom->dtc_dmaca_rx_enable)
            {
                if (NULL != p_rctrl->p_rx_fraction_buf)
                {
                    p_rctrl->p_rx_buf = p_rctrl->p_rx_fraction_buf;
                    p_rctrl->p_rx_fraction_buf = NULL;
                }

                if (p_rctrl->rx_cnt > p_rctrl->rx_fraction)
                {
                    p_rctrl->rx_cnt = p_rctrl->rx_fraction;
                }
            }
#endif

            if (0 != SCI_PRV_RX_FIFO_USED_CNT)
            {

                /* loop until request completed or no more data in FIFO */
                /* WAIT_LOOP */
                while ((0 != SCI_PRV_RX_FIFO_USED_CNT) && (0 != p_rctrl->rx_cnt))
                {
                    if (NULL == p_rctrl->p_rx_buf)   /* ignore data for Sync Send() */
                    {
                        byte = hdl->rom->regs->FRDR.BYTE.L;
                    }
                    else
                    {

                        tmp_reg_frdr = hdl->rom->regs->FRDR.BYTE.L;   /* read byte */
                        *p_rctrl->p_rx_buf = tmp_reg_frdr;   /* read byte */
                        p_rctrl->p_rx_buf++;
                    }
                    p_rctrl->rx_cnt--;     /* decrement number of bytes yet to read */
                }
            }

            if (0 == p_rctrl->rx_cnt)
            {
                hdl->tx_idle = true;

                /* Do callback if available */
                if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
                {
                    args.hdl = hdl;
                    args.event = SCI_EVT_RX_SYNC_DONE;

                    /* Casting pointer to void* type is valid */
                    hdl->callback((void *)&args);
                }
            }

            /* If remaining data to read is less than threshold, adjust threshold */
            else
            {
                if (p_rctrl->rx_cnt < hdl->rx_dflt_thresh)
                {
                    SCI_PRV_RX_FIFO_THRESHOLD = p_rctrl->rx_cnt;
                }
                else
                {
                    SCI_PRV_RX_FIFO_THRESHOLD = hdl->rx_dflt_thresh;
                }
            }

            /* If at threshold level, clear bit so can get another RXIF interrupt.
             * Do not re-arm if Receive() request not outstanding (Async)
             */
            if ((1 == hdl->rom->regs->SSRFIFO.BIT.RDF) && (0 != p_rctrl->rx_cnt))
            {
                hdl->rom->regs->SSRFIFO.BIT.RDF = 0;
            }

        }
    }
    else
#endif /* (RX_DTC_DMACA_ENABLE) */
    {
         fifo_num_rx = hdl->rom->regs->FDR.BIT.R;

        /* WAIT_LOOP */
        for (cnt = 0; cnt < fifo_num_rx; cnt++)
        {
            SCI_RDR(byte_rx[cnt]);
        }

        hdl->rx_cnt -= fifo_num_rx;

        /* Place byte in buffer if Receive() or SendReceive() */
        if (true == hdl->save_rx_data)
        {
            /* WAIT_LOOP */
            for (cnt = 0; cnt < fifo_num_rx; cnt++)
            {
                /* SCI Receive */
                *hdl->u_rx_data.buf++ = byte_rx[cnt];
            }
        }

        /* See if more bytes to transfer */
        if (0 < hdl->rx_cnt)
        {
            if (hdl->rom->regs->FCR.BIT.RTRG > hdl->rx_cnt)
            {
                hdl->rom->regs->FCR.BIT.RTRG = hdl->rx_cnt;
            }

            if (0 < hdl->tx_cnt)
            {
                if (hdl->tx_cnt > fifo_num_rx)
                {
                    fifo_num_tx  = fifo_num_rx;
                    hdl->tx_cnt -= fifo_num_rx;
                }
                else
                {
                    fifo_num_tx  = hdl->tx_cnt;
                    hdl->tx_cnt  = 0;
                }

                /* send another byte */
                if (true == hdl->tx_dummy)
                {
                    /* WAIT_LOOP */
                    for (cnt = 0; cnt < fifo_num_tx; cnt++)
                    {
                        SCI_TDR(SCI_CFG_DUMMY_TX_BYTE);
                    }
                }
                else
                {
                    /* WAIT_LOOP */
                    for (cnt = 0; cnt < fifo_num_tx; cnt++)
                    {
                        hdl->u_tx_data.buf++;
                        SCI_TDR(*hdl->u_tx_data.buf);
                    }
                }
            }
        }
        else
        {
            hdl->rom->regs->FCR.BIT.RTRG = hdl->rx_curr_thresh;
            hdl->tx_idle = true;

