avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
            /* Do callback if available */
            if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
            {
                args.hdl = hdl;
                args.event = SCI_EVT_XFER_DONE;

                /* Casting pointer to void* type is valid */
                hdl->callback((void *)&args);
            }
        }
    }

} /* End of function sci_fifo_receive_sync() */
#endif /* End of SCI_CFG_FIFO_INCLUDED */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

#if SCI_CFG_FIFO_INCLUDED
/*****************************************************************************
* Function Name: sci_fifo_receive
* Description  : FIFO Receive for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_receive(sci_hdl_t const hdl)
{
#if (SCI_CFG_ASYNC_INCLUDED)
    uint16_t        cnt;
    uint16_t        fifo_num;
    sci_cb_args_t   args;
    uint8_t         byte_rx[SCI_FIFO_FRAME_SIZE];
#endif
    if (SCI_MODE_ASYNC == hdl->mode)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
#if(RX_DTC_DMACA_ENABLE)
        if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
        {
            sci_fifo_ctrl_t        *p_rctrl;
            volatile uint8_t            byte;   /* volatile to remove "not used" warning */
            uint8_t                     tmp_reg_frdr;
            sci_cb_args_t               args;
#if (RX_DTC_DMACA_ENABLE & 0x02)
            if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable)
            {
                R_DMACA_Int_Disable(hdl->rom->dmaca_rx_channel);
                R_DMACA_Close(hdl->rom->dmaca_rx_channel);
            }
#endif
            p_rctrl = &hdl->queue[hdl->qindex_app_rx];

            if (NULL != p_rctrl->p_rx_fraction_buf)
            {
                p_rctrl->p_rx_buf = p_rctrl->p_rx_fraction_buf;
                p_rctrl->p_rx_fraction_buf = NULL;
            }

            if (p_rctrl->rx_cnt > p_rctrl->rx_fraction)
            {
                p_rctrl->rx_cnt = p_rctrl->rx_fraction;
            }

            if (0 != SCI_PRV_RX_FIFO_USED_CNT)
            {
                /* loop until request completed or no more data in FIFO */
                /* WAIT_LOOP */
                while ((0 != SCI_PRV_RX_FIFO_USED_CNT) && (0 != p_rctrl->rx_cnt))
                {
                    if (NULL == p_rctrl->p_rx_buf)   /* ignore data for Sync Send() */
                    {
                        byte = hdl->rom->regs->FRDR.BYTE.L;
                    }
                    else
                    {
                        tmp_reg_frdr = hdl->rom->regs->FRDR.BYTE.L;   /* read byte */
                        *p_rctrl->p_rx_buf = tmp_reg_frdr;   /* read byte */
                        p_rctrl->p_rx_buf++;
                    }
                    p_rctrl->rx_cnt--;     /* decrement number of bytes yet to read */
                }
            }
            if (0 == p_rctrl->rx_cnt)
            {
                /* call callback function if available */
                if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
                {
                    args.hdl = hdl;
                    args.event = SCI_EVT_RX_DONE;
                    hdl->callback(&args);
                }
            }

            /* If remaining data to read is less than threshold, adjust threshold */
            else // DTC will do here
            {
                if (p_rctrl->rx_fraction < hdl->rx_dflt_thresh)
                {
                    SCI_PRV_RX_FIFO_THRESHOLD = p_rctrl->rx_fraction;
                }
                else
                {
                    SCI_PRV_RX_FIFO_THRESHOLD = hdl->rx_dflt_thresh;
                }
            }
        }
        else
    #endif /* (RX_DTC_DMACA_ENABLE) */
        {
            /* Casting unsigned char type to uint16_t type is valid */
            fifo_num = (uint16_t)hdl->rom->regs->FDR.BIT.R;

            /* RX FIFO flush */
            /* WAIT_LOOP */
            for (cnt = 0; cnt < fifo_num; cnt++)
            {
                /* Read byte */
                SCI_RDR(byte_rx[cnt]);
            }

            /* Determine amount of space left in rx queue */
            (void)R_BYTEQ_Unused(hdl->u_rx_data.que, &cnt);
            if (cnt >= fifo_num)
            {
                /* free space is enough */
                args.event = SCI_EVT_RX_CHAR;
            }
            else
            {
                /* insufficient free space, store as much as possible */
                fifo_num = cnt;
                args.event = SCI_EVT_RXBUF_OVFL;
            }

            /* WAIT_LOOP */
            for (cnt = 0; cnt < fifo_num; cnt++)
            {
                /* store bytes to rx queue for R_SCI_Receive */
                (void)R_BYTEQ_Put(hdl->u_rx_data.que, byte_rx[cnt]);
            }

            /* Do callback if available */
            if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
            {
                args.hdl = hdl;

                /* Number of bytes were stored to queue */
                args.num = (uint8_t)fifo_num;

                /* Casting pointer to void* type is valid */
                hdl->callback((void *)&args);
            }
        }
#endif /* End of SCI_CFG_ASYNC_INCLUDED*/
    }
   else
    {
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
        /* SCI Receive */
        sci_fifo_receive_sync(hdl);
#endif
    }

    /* When the readings of receive data are completed, set the SSRFIFO.RDF flag to 0. */
    if (1 == hdl->rom->regs->SSRFIFO.BIT.RDF)
    {
        /* Casting 8 bits to unsigned char type is valid */
        hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_RDF_MASK;
    }

    if (SCI_MODE_ASYNC == hdl->mode)
    {
        if (1 == hdl->rom->regs->SSRFIFO.BIT.DR)
        {
            /* Casting 8 bits to unsigned char type is valid */
            hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_DR_MASK;
        }
    }
} /* End of function sci_fifo_receive() */
#endif /* End of SCI_CFG_FIFO_INCLUDED */

#if SCI_CFG_DATA_MATCH_INCLUDED
/*****************************************************************************
* Function Name: sci_receive_data_match
* Description  : SCI receive data match
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_receive_data_match(sci_hdl_t const hdl)
{
    volatile sci_cb_args_t   args;
    volatile uint8_t         byte;

    if (SCI_MODE_ASYNC == hdl->mode)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
        if (0 == hdl->rom->regs->DCCR.BIT.DCME) /* DCME automatically set 0 when data matched */
        {
            hdl->rom->regs->DCCR.BIT.DCMF = 0; /* Clear Data Match Flag */

            if ((0 == hdl->rom->regs->DCCR.BIT.DFER )  &&  (0 == hdl->rom->regs->DCCR.BIT.DPER )) /* Check framing error and parity error */
            {
                /* Casting unsigned char type to unin8_t type is valid */
                byte = (uint8_t)(hdl->rom->regs->CDR.BYTE.L); /* Read data from comparison data register */

                /* Place byte in queue */
                if (R_BYTEQ_Put(hdl->u_rx_data.que, byte) == BYTEQ_SUCCESS)
                {
                    args.event = SCI_EVT_RX_CHAR_MATCH;
                }
                else
                {
                    args.event = SCI_EVT_RXBUF_OVFL;
                }

