avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
                /* Do callback if available */
                if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
                {
                    args.hdl = hdl;
                    args.byte = byte;

                    /* Casting to void* type is valid  */
                    hdl->callback((void *)&args);
                }
            }
        }
#endif /* End of SCI_CFG_ASYNC_INCLUDED */
    }
} /* End of function sci_receive_data_match() */
#endif /* End of SCI_CFG_DATA_MATCH_INCLUDED */

/*****************************************************************************
* Function Name: rxi_handler
* Description  : RXI interrupt handler for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
void rxi_handler(sci_hdl_t const hdl)
{
#if SCI_CFG_DATA_MATCH_INCLUDED
    if (1 == hdl->rom->regs->DCCR.BIT.DCMF) /* Check Data match flag */
    {
        sci_receive_data_match(hdl);
    }
    else
#endif
    {
#if SCI_CFG_FIFO_INCLUDED
        if (true == hdl->fifo_ctrl)
        {
             /* SCI FIFO Receive */
             sci_fifo_receive(hdl);
        }
        else
#endif
        {
#if (RX_DTC_DMACA_ENABLE)
            if((SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
            {
                sci_fifo_ctrl_t        *p_rctrl;
                p_rctrl = &hdl->queue[hdl->qindex_app_rx];
                sci_cb_args_t   args;
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
                if ((SCI_MODE_SYNC == hdl->mode) || (SCI_MODE_SSPI == hdl->mode))
                {
                    hdl->tx_idle = true;
                }
#endif
                if (NULL != p_rctrl->p_rx_fraction_buf)
                {
                    p_rctrl->p_rx_buf = p_rctrl->p_rx_fraction_buf;
                    p_rctrl->p_rx_fraction_buf = NULL;
                }

                if (p_rctrl->rx_cnt > p_rctrl->rx_fraction)
                {
                    p_rctrl->rx_cnt = p_rctrl->rx_fraction;
                }

                /* Do callback if available */
                if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
                {
                    args.hdl = hdl;
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
                    if ((SCI_MODE_SYNC == hdl->mode) || (SCI_MODE_SSPI == hdl->mode))
                    {
                        args.event = SCI_EVT_RX_SYNC_DONE;
                    }
                    else
#endif
                    {
                        args.event = SCI_EVT_RX_DONE;
                    }

                    /* Casting to void type is valid */
                    hdl->callback((void *)&args);
                }

            }
            else
#endif /* (RX_DTC_DMACA_ENABLE) */
            {
                /* SCI Receive */
                sci_receive(hdl);
            }
        }
    }
} /* End of function rxi_handler() */


/*****************************************************************************
* Function Name: sci_error
* Description  : Error for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_error(sci_hdl_t const hdl)
{
    sci_cb_args_t   args;
    uint8_t         byte;
    uint8_t         reg;

    reg = SCI_SSR;
    if (0 != (reg & SCI_RCVR_ERR_MASK))
    {
        if (0 != (reg & SCI_SSR_ORER_MASK))
        {
            args.event = SCI_EVT_OVFL_ERR;
        }
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
#if (SCI_CFG_ASYNC_INCLUDED)
        else if (0 != (reg & SCI_SSR_PER_MASK))
        {
            args.event = SCI_EVT_PARITY_ERR;
        }
#endif
        else if (0 != (reg & SCI_SSR_FER_MASK))
        {
            args.event = SCI_EVT_FRAMING_ERR;
        }
#endif
        else
        {
            /* Do Nothing */
        }

        /* Flush register */
        SCI_RDR(byte);

        /* Clear error condition */
        /* WAIT_LOOP */
        while (0 != (SCI_SSR & SCI_RCVR_ERR_MASK))
        {
            SCI_RDR(byte);

            reg      = SCI_SSR;
            reg     &= (~SCI_RCVR_ERR_MASK);
            reg     |= SCI_SSR_CLR_MASK;
            SCI_SSR  = reg;

            if (0 != (SCI_SSR & SCI_RCVR_ERR_MASK))
            {
                R_BSP_NOP(); /* read and Compare */
            }
        }

        /* Do callback for error */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void* type is valid */
            hdl->callback((void *)&args);
        }
    }

} /* End of function sci_error() */

#if SCI_CFG_FIFO_INCLUDED
/*****************************************************************************
* Function Name: sci_fifo_error
* Description  : FIFO Error for SCI
* Arguments    : hdl - 
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_error(sci_hdl_t const hdl)
{
    sci_cb_args_t       args;
    uint8_t             reg;
    volatile uint8_t    ssrfifo_data;
    volatile uint16_t   dummy;

    reg = SCI_SSRFIFO;
    if (0 != (reg & SCI_RCVR_ERR_MASK))
    {
        if (0 != (reg & SCI_SSR_ORER_MASK))
        {
            args.event = SCI_EVT_OVFL_ERR;
        }
#if (SCI_CFG_ASYNC_INCLUDED)
        else if (0 != (reg & SCI_SSR_PER_MASK))
        {
            args.event = SCI_EVT_PARITY_ERR;
        }
        else if (0 != (reg & SCI_SSR_FER_MASK))
        {
            args.event = SCI_EVT_FRAMING_ERR;
        }
#endif
        else
        {
            /* Do Nothing */
        }

        /* Do callback for error */
        if ((NULL != hdl->callback) && (FIT_NO_FUNC != hdl->callback))
        {
            args.hdl = hdl;
            args.byte = 0;

            /* Casting pointer to void* type is valid */
            hdl->callback((void *)&args);
        }

        /* if error condition don't clear in callback when it clear at here */
        reg = SCI_SSRFIFO;
        if (0 != (reg & SCI_RCVR_ERR_MASK))
        {
            /* Flush register */
            /* WAIT_LOOP */
            while (0 != hdl->rom->regs->FDR.BIT.R)
            {
                dummy = hdl->rom->regs->FRDR.WORD;              /* FRDR dummy read */
            }

