avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
            /* change TX FIFO threshold */
            hdl->rom->regs->SCR.BYTE &= (~SCI_EN_XCVR_MASK);
            SCI_SCR_DUMMY_READ;

            /* Casting void* type is valid */
            hdl->rom->regs->FCR.BIT.TTRG = *((uint8_t *)p_args);
            SCI_IR_TXI_CLEAR;
            hdl->rom->regs->SCR.BYTE |= SCI_EN_XCVR_MASK;
        }
        else
        {
            err = SCI_ERR_INVALID_ARG;
        }
        break;
    }

    case (SCI_CMD_CHANGE_RX_FIFO_THRESH):
    {
        if (true == hdl->fifo_ctrl)
        {
#if ((SCI_DTC_DMACA_DISABLE != RX_DTC_DMACA_ENABLE) || (SCI_DTC_DMACA_DISABLE != TX_DTC_DMACA_ENABLE))
            if((SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_rx_enable) || (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_rx_enable))
            {
                return SCI_ERR_DTC_DMACA_NOT_SUPPORT;
            }
#endif
            /* save current RX FIFO threshold */
            hdl->rx_curr_thresh = *((uint8_t *)p_args);

            /* change RX FIFO threshold */
            hdl->rom->regs->SCR.BYTE &= (~SCI_EN_XCVR_MASK);
            SCI_SCR_DUMMY_READ;

            /* Casting void* type is valid */
            hdl->rom->regs->FCR.BIT.RTRG = *((uint8_t *)p_args);
            SCI_IR_TXI_CLEAR;
            hdl->rom->regs->SCR.BYTE |= SCI_EN_XCVR_MASK;
        }
        else
        {
            err = SCI_ERR_INVALID_ARG;
        }
        break;
    }
#endif /* End of SCI_CFG_FIFO_INCLUDED */

    case (SCI_CMD_SET_TXI_PRIORITY):
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N)|| defined(BSP_MCU_RX671)
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr_txi = *((uint8_t *)p_args);
        break;
    }
#else
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr = *((uint8_t *)p_args);
        break;
    }
#endif
    case (SCI_CMD_SET_RXI_PRIORITY):
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N)|| defined(BSP_MCU_RX671)
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr_rxi = *((uint8_t *)p_args);
        break;
    }
#else
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr = *((uint8_t *)p_args);
        break;
    }
#endif

    case (SCI_CMD_SET_TXI_RXI_PRIORITY):
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66T) || defined(BSP_MCU_RX72T) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N)|| defined(BSP_MCU_RX671)
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr_txi = *((uint8_t *)p_args);
        *hdl->rom->ipr_rxi = *((uint8_t *)p_args);
        break;
    }
#else
    {
        /* Casting void type to uint8_t type is valid */
        *hdl->rom->ipr = *((uint8_t *)p_args);
        break;
    }
#endif

    default:
    {
        /* ASYNC-SPECIFIC COMMANDS */
        if (SCI_MODE_ASYNC == hdl->mode)
        {
#if (SCI_CFG_ASYNC_INCLUDED)
            err = sci_async_cmds(hdl, cmd, p_args);
#endif
        }
        /* IRDA-SPECIFIC COMMANDS */
        else if (SCI_MODE_IRDA == hdl->mode)
        {
#if (SCI_CFG_IRDA_INCLUDED)
            err = sci_irda_cmds(hdl, cmd, p_args);
#endif
        }
        /* SSPI/SYNC-SPECIFIC COMMANDS */
        else
        {
#if (SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED)
            err = sci_sync_cmds(hdl, cmd, p_args);
#endif
        }
        break;
    }
    }

    return err;
} /* End of function R_SCI_Control() */

/***********************************************************************************************************************
* Function Name: R_SCI_Close
********************************************************************************************************************//**
* @brief This function removes power from the SCI channel and disables the associated interrupts.
*
* @param[in] hdl  Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
*
* @retval SCI_SUCCESS Successful; channel closed
*
* @retval SCI_ERR_NULL_PTR hdl is NULL 
*
* @details    Disables the SCI channel designated by the handle and enters module-stop state.
* @note This function will abort any transmission or reception that may be in progress.
*/
sci_err_t R_SCI_Close(sci_hdl_t const hdl)
{

#if SCI_CFG_PARAM_CHECKING_ENABLE
    /* Check argument hdl */
    if ((NULL == hdl) || (FIT_NO_PTR == hdl))
    {
        return SCI_ERR_NULL_PTR;
    }
#endif

    /* disable ICU interrupts */
        sci_disable_ints(hdl);

    /* stop IrDA function */    
    if (SCI_MODE_IRDA == hdl->mode)
    {
#if (SCI_CFG_IRDA_INCLUDED)
        sci_irda_close(hdl);
#endif
    }

    /* free tx and rx queues */
#if (SCI_CFG_ASYNC_INCLUDED || SCI_CFG_IRDA_INCLUDED)
    if ((SCI_MODE_ASYNC == hdl->mode) || (SCI_MODE_IRDA == hdl->mode))
    {
#if (TX_DTC_DMACA_ENABLE & 0x01 || TX_DTC_DMACA_ENABLE & 0x02)
        /* DTC/DMAC don't use the queue */
        if ((SCI_DTC_ENABLE != hdl->rom->dtc_dmaca_tx_enable) && (SCI_DMACA_ENABLE != hdl->rom->dtc_dmaca_tx_enable))
        {
            R_BYTEQ_Close(hdl->u_tx_data.que);
            R_BYTEQ_Close(hdl->u_rx_data.que);
        }
#else
        R_BYTEQ_Close(hdl->u_tx_data.que);
        R_BYTEQ_Close(hdl->u_rx_data.que);
#endif
    }
#endif
#if SCI_CFG_FIFO_INCLUDED
    if (true == hdl->fifo_ctrl)
    {
        /* reset FIFO threshold */
        hdl->rx_curr_thresh = hdl->rx_dflt_thresh;
        hdl->tx_curr_thresh = hdl->tx_dflt_thresh;
    }
#endif

         /* mark the channel as not in use and power down */
        power_off(hdl);
        hdl->mode = SCI_MODE_OFF;

    return SCI_SUCCESS;
} /* End of function R_SCI_Close() */


/***********************************************************************************************************************
* Function Name: R_SCI_GetVersion
********************************************************************************************************************//**
* @brief This function returns the driver version number at runtime.
* @return Version number.
* @details  Returns the version of this module. The version number is encoded such that the top 2 bytes are the major
* version number and the bottom 2 bytes are the minor version number.
* @note None
*/
uint32_t  R_SCI_GetVersion(void)
{
    uint32_t const version = (SCI_VERSION_MAJOR << 16) | SCI_VERSION_MINOR;

    return version;
} /* End of function R_SCI_GetVersion() */

#if ((TX_DTC_DMACA_ENABLE & 0x02) && (SCI_CFG_FIFO_INCLUDED))
/*****************************************************************************
* Function Name: sci_fifo_transfer_dmac
* Description  : Handle txi in case this channel use DMAC for transferring.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_transfer_dmac(sci_hdl_t const hdl)
{
    sci_fifo_ctrl_t        *p_tctrl = &hdl->queue[hdl->qindex_app_rx];
    if (NULL != p_tctrl->p_tx_fraction_buf)
    {
        p_tctrl->p_tx_buf = p_tctrl->p_tx_fraction_buf;
        p_tctrl->p_tx_fraction_buf = NULL;
    }

