avnet-iotconnect/iotc-azurertos-sdk/samples/rx65ncloudkit/sample_azure_iot_embedded_sdk/src/smc_gen/r_sci_rx/src/r_sci_rx.c
    if (p_tctrl->tx_cnt > p_tctrl->tx_fraction)
    {
        p_tctrl->tx_cnt = p_tctrl->tx_fraction;
    }

    if (0 != p_tctrl->tx_cnt)
    {
        /* loop until no more data to send or fifo becomes full */
        /* WAIT_LOOP */
        while ((0 != p_tctrl->tx_cnt) && (SCI_FIFO_FRAME_SIZE != hdl->rom->regs->FDR.BIT.T))
        {
            if (NULL == p_tctrl->p_tx_buf)   /* Sync only */
            {
                hdl->rom->regs->FTDR.BYTE.L = SCI_CFG_DUMMY_TX_BYTE;
            }
            else
            {
                hdl->rom->regs->FTDR.BYTE.L = *p_tctrl->p_tx_buf;
                p_tctrl->p_tx_buf++;
            }

            p_tctrl->tx_cnt--;

            /* if all of current message loaded, set index to next message */
            if (0 == p_tctrl->tx_cnt)
            {
#if (SCI_CFG_ASYNC_INCLUDED)
                if (SCI_MODE_ASYNC == hdl->mode)
                {
                     hdl->tx_idle = true;
                }
#endif
                DISABLE_TXI_INT;
            }
        }
    }

    if (1 == hdl->rom->regs->SSRFIFO.BIT.TDFE)
    {
        /* Casting register 8 bits to unsigned char type is valid */
#if((TX_DTC_DMACA_ENABLE & 0x02))
        if (SCI_DMACA_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
        {
            hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_TDFE_MASK;
        }
#endif
    }

    if(0 == p_tctrl->tx_cnt)
    {
#if (SCI_CFG_ASYNC_INCLUDED)
    if (SCI_MODE_ASYNC == hdl->mode)
    {
        hdl->tx_idle = true;
    }
#endif
#if SCI_CFG_TEI_INCLUDED
        /* Enable transmit end interrupt */
        hdl->rom->regs->SCR.BIT.TEIE = 1;
        ENABLE_TEI_INT;
#endif
        DISABLE_TXI_INT;
    }
} /* End of function sci_fifo_transfer_dmac() */
#endif /* ((TX_DTC_DMACA_ENABLE & 0x02) && (SCI_CFG_FIFO_INCLUDED)) */

#if ((TX_DTC_DMACA_ENABLE & 0x01) && (SCI_CFG_FIFO_INCLUDED))
    /*****************************************************************************
* Function Name: sci_fifo_transfer_dtc
* Description  : Handle txi in case this channel use DTC for transferring.
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
* Return Value : none
******************************************************************************/
static void sci_fifo_transfer_dtc(sci_hdl_t const hdl)
{
    if (SCI_DTC_ENABLE == hdl->rom->dtc_dmaca_tx_enable)
    {
        sci_fifo_ctrl_t        *p_tctrl = &hdl->queue[hdl->qindex_app_rx];

        hdl->qindex_int_tx ++;

        if (1 == hdl->qindex_int_tx)
        {
           if ((0 != p_tctrl->tx_fraction) && (hdl->rom->dtc_dmaca_tx_block_size > p_tctrl->total_length))
            {
               hdl->qindex_int_tx = 0;
                if (0 == p_tctrl->tx_cnt)
                {
                    if (1 == hdl->rom->regs->SSRFIFO.BIT.TDFE)
                    {
                         hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_TDFE_MASK;
                    }
                    DISABLE_TXI_INT;
                }
                else
                {
                    if (NULL != p_tctrl->p_tx_fraction_buf)
                    {
                        p_tctrl->p_tx_buf = p_tctrl->p_tx_fraction_buf;
                        p_tctrl->p_tx_fraction_buf = NULL;
                    }
                    if (p_tctrl->tx_cnt > p_tctrl->tx_fraction)
                    {
                        p_tctrl->tx_cnt = p_tctrl->tx_fraction;
                    }
                    while ((0 != p_tctrl->tx_cnt) && (SCI_FIFO_FRAME_SIZE != hdl->rom->regs->FDR.BIT.T))
                    {
                        if (NULL == p_tctrl->p_tx_buf)   /* Sync only */
                        {
                            hdl->rom->regs->FTDR.BYTE.L = SCI_CFG_DUMMY_TX_BYTE;
                        }
                        else
                        {
                            hdl->rom->regs->FTDR.BYTE.L = *p_tctrl->p_tx_buf;
                            p_tctrl->p_tx_buf++;
                        }
                        p_tctrl->tx_cnt--;
                    }

                    DISABLE_TXI_INT;
#if SCI_CFG_TEI_INCLUDED
                    /* Enable transmit end interrupt */
                    hdl->rom->regs->SCR.BIT.TEIE = 1;
                    ENABLE_TEI_INT;
#endif

#if (SCI_CFG_ASYNC_INCLUDED)
                if (SCI_MODE_ASYNC == hdl->mode)
                {
                     hdl->tx_idle = true;
                }
#endif
                    if (1 == hdl->rom->regs->SSRFIFO.BIT.TDFE)
                    {
                         hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_TDFE_MASK;
                    }
                }
            }
        }
        else if(2 == hdl->qindex_int_tx) //The second time is SCI interrupt, will clear TDFE bit here.
        {
            hdl->qindex_int_tx = 0;
            if (NULL != p_tctrl->p_tx_fraction_buf)
            {
                p_tctrl->p_tx_buf = p_tctrl->p_tx_fraction_buf;
                p_tctrl->p_tx_fraction_buf = NULL;
            }

            if (p_tctrl->tx_cnt > p_tctrl->tx_fraction)
            {
                p_tctrl->tx_cnt = p_tctrl->tx_fraction;
            }

            if (0 != p_tctrl->tx_cnt)
            {
                /* loop until no more data to send or fifo becomes full */
                /* WAIT_LOOP */
                while ((0 != p_tctrl->tx_cnt) && (SCI_FIFO_FRAME_SIZE != hdl->rom->regs->FDR.BIT.T))
                {
                    if (NULL == p_tctrl->p_tx_buf)   /* Sync only */
                    {
                        hdl->rom->regs->FTDR.BYTE.L = SCI_CFG_DUMMY_TX_BYTE;
                    }
                    else
                    {
                        hdl->rom->regs->FTDR.BYTE.L = *p_tctrl->p_tx_buf;
                        p_tctrl->p_tx_buf++;
                    }

                    p_tctrl->tx_cnt--;

                    /* if all of current message loaded, set index to next message */
                    if (0 == p_tctrl->tx_cnt)
                    {
#if (SCI_CFG_ASYNC_INCLUDED)
                if (SCI_MODE_ASYNC == hdl->mode)
                {
                     hdl->tx_idle = true;
                }
#endif
                        DISABLE_TXI_INT;
                    }
                }
            }

            if (1 == hdl->rom->regs->SSRFIFO.BIT.TDFE)
            {
                /* Casting register 8 bits to unsigned char type is valid */

                hdl->rom->regs->SSRFIFO.BYTE = (unsigned char)~SCI_SSRFIFO_TDFE_MASK;
            }

            if(0 == p_tctrl->tx_cnt)
            {
#if (SCI_CFG_ASYNC_INCLUDED)
                if (SCI_MODE_ASYNC == hdl->mode)
                {
                     hdl->tx_idle = true;
                }
#endif
#if SCI_CFG_TEI_INCLUDED
                /* Enable transmit end interrupt */
                hdl->rom->regs->SCR.BIT.TEIE = 1;
                ENABLE_TEI_INT;
#endif
                DISABLE_TXI_INT;
            }
        }
    }
} /* End of function sci_fifo_transfer_dmac() */
#endif /* ((TX_DTC_DMACA_ENABLE & 0x01) && (SCI_CFG_FIFO_INCLUDED)) */
